INSERT INTO `location_status` VALUES
                                  (1,'В місті відправлення'),
                                  (2,'В дорозі'),
                                  (3,'У відділенні пошти'),
                                  (4,'Отримано');

INSERT INTO `payment_status` VALUES
                                 (1,'На розгляді'),
                                 (2,'Очікує оплату'),
                                 (3,'Оплачено');

INSERT INTO `role` VALUES
                       (1,'USER'),
                       (2,'MANAGER'),
                       (3,'ADMIN'),
                       (4,'EMPLOYEE');

INSERT INTO `user` VALUES
                       (1,'user','$2a$10$5P1oORCyIjdbpd4wyoGB6uhMzDU4XmatqQVM5mWBypBr.7OGqw5DW','Костянтин','Бороздих','+380938988645','kostiaborozdyh@gmail.com',1738,1,'yes','no'),
                       (2,'user1','$2a$12$pqSsaAKJ.lGCQAKAR2a1fePbLaKvZg2sXdL.SBECGwif8K2oH30PC','Maks','Prokopenko','+380938988645','kostiaborozdyh1@gmail.com',700,1,'no','no'),
                       (4,'user3','$2a$12$pqSsaAKJ.lGCQAKAR2a1fePbLaKvZg2sXdL.SBECGwif8K2oH30PC','Oleh','Marin','+380938988645','kostiaborozdyh3@gmail.com',100,1,'yes','no'),
                       (5,'manager','$2a$12$cTsuUO.GrYZvB9/Ing0T8OGtF6mJ3TmTh83dPf5D9gP9JXxse7zZS','Менеджер','Менеджер','+380777777778','manager@gmail.com',2000,2,'no','no'),
                       (21,'admin','$2a$12$/ZVyEKoEpm0ZSGwc5WiuguNzxLQ.BO/SVezlCNYSS2iIk4b5UoS5S','ADMIN','ADMIN','+380123456789','admin.delivery.holder@gmail.com',NULL,3,'no','no'),
                       (31,'employee','$2a$12$hJI9rgBcKy7Fris.a/.7tuYlomztIW73bJfCB5gSYZHrx1YujSvZi','employee','employee','+380123212343','employee@gmail.com',NULL,4,'no','no'),
                       (32,'user12','$2a$12$/RE.mOh2EAqtut5T/QGR3OUPaaysD3HhT9od3nLz3sjlTon46.uOq','userPuser','userPuser','+380123232343','kostiabo@gmail.com',NULL,1,'no','no'),
                       (34,'user23','$2a$10$OCSxlE3V8x7sF4b9SDzP9ug2GwBc/kb5/vH6fdSphQ0tdvpqU3sU6','user','user','+380938988645','kostiabrozdyh@gmail.com',0,1,'yes','no'),
                       (35,'adminchik','$2a$10$btJTxt4OQITVS5X9cpVPeOS8JCZIFai64p/X/r/eqF65Yge6DXr1i','managerThree','managerThree','+380938988645','adm@gmail.com',0,1,'no','no'),
                       (36,'userTest','$2a$10$zGrAGGE.0FvaGoUS4EA2xO5uNI8RD5E2g5pxhdgseBlRumwbgAfty','Бороздих','Миколайович','+380938988645','koaborozdyh@gmail.com',0,1,'no','no');

INSERT INTO `review` VALUES
                         (1,1,'Все було супер, доставити дуже швидко!','2022-05-25'),
                         (2,1,'Ціна та якість на вищому рівні!','2022-05-26'),
                         (3,1,'Компанія бомба','2022-05-27'),
                         (4,2,'Не дуже сподобалось обслуговування','2022-05-28'),
                         (5,1,'Впринципі по ціні і якості ок','2022-05-29'),
                         (6,1,'ок, сойдьот','2022-05-31'),
                         (7,1,'перший відгук на спрінгу','2022-06-10'),
                         (8,1,'Другий відгук на спрінгу','2022-06-10'),
                         (9,1,'топ доставка на спрінгу','2022-06-28');

INSERT INTO `orders` VALUES
                         (16,'tovar1',1,1,24,'Київ, Україна','Луцьк, Волинська область','address','2022-05-21','2022-05-29','2022-06-02',1,3,4),
                         (17,'tovar2',1,2,100,'Черкаси, Україна','Канів, Україна','Адреса2','2022-05-18','2022-05-18','2022-05-19',1,3,4),
                         (18,'Товар3',2,2,500,'Кривий Ріг, Україна','Харків, Україна','Адреса3','2022-05-20','2022-05-20','2022-05-22',1,3,4),
                         (19,'Товар4',2,4,465,'Чернігів, Україна','Одеса, Україна','Адреса4','2022-05-20','2022-05-20','2022-05-23',1,3,4),
                         (20,'Tovar5',3,9,460,'Дніпро, Україна','Вінниця, Україна','address5','2022-05-19','2022-05-19','2022-05-23',1,3,4),
                         (21,'Товар6',4,4,900,'Львів, Україна','Миколаїв, Україна','Адреса6','2022-05-18','2022-05-18','2022-05-23',1,3,3),
                         (22,'Товар7',7,5,763,'Київ, Україна','Кривий Ріг, Україна','Адреса7','2022-05-21','2022-05-21','2022-05-24',1,3,4),
                         (23,'Товар8',4,4,603,'Черкаси, Україна','Донецьк, Україна','Адреса8','2022-05-21','2022-05-21','2022-05-23',1,3,3),
                         (24,'Tovar9',3,4,697,'Черкаси, Україна','Варшава, Польща','Адреса9','2022-05-21','2022-05-21','2022-05-23',1,3,4),
                         (25,'Tovar9',2,1,82,'Сміла, Україна','Івано-Франківськ, Україна','Адреса9','2022-05-21','2022-05-21','2022-05-23',1,3,4),
                         (26,'Tovar11',3,2,731,'Кривий Ріг, Україна','Луцьк, Волинська область','address11','2022-05-22','2022-05-22','2022-05-30',1,3,3),
                         (27,'Tovar12',1,4,284,'Київ, Україна','Одеса, Україна','Address12','2022-05-23','2022-05-23','2022-05-27',1,3,4),
                         (28,'Tovar13',1,4,260,'Київ, Україна','Донецьк, Україна','Адреса13','2022-05-22','2022-05-23','2022-05-26',1,3,2),
                         (30,'Tovar15',3,1,110,'Кривий Ріг, Україна','Черкаси, Україна','Гетьмана Сагайдачного 174','2022-05-29','2022-05-29','2022-05-30',1,3,2),
                         (33,'Новий Товар',2,3,400,'Черкаси, Україна','Одеса, Україна','Центральна 51','2022-06-01','2022-06-02','2022-06-04',1,3,3),
                         (35,'Товар18',3,1,1144,'Чернігів, Україна','Париж, Франція','Центральна 51','2022-06-03','2022-06-03','2022-06-12',1,3,4),
                         (39,'Test_Confirm_2',1,2,102,'Київ, Україна','Черкаси, Україна','Гармантна 51','2022-06-10','2022-06-12','2022-06-14',1,3,3),
                         (40,'Spring_Tovar',1,2,100,'Київ, Україна','Полтава, Україна','Торгова 68','2022-06-14','2022-06-14','2022-06-16',1,3,2),
                         (41,'тест спрінга після логування',1,2,105,'Київ, Україна','Полтава, Україна','Туренка 43','2022-06-16','2022-06-16','2022-06-17',1,3,2),
                         (42,'товар',1,4,115,'Київ, Україна','Черкаси, Україна','том1','2022-06-28','2022-06-28','2022-06-29',1,3,2);